<template>
  <div>
    <div class="bg_content">
      <div class="shade"></div>
      <div class="bg_regist">
        <label class="regist">注册</label>
        <div class="input">
          <input
            type="text"
            placeholder="账号(请输入手机号码)"
            v-model="regist_account"
            @blur="check_account"
            autofocus="true"
          >
          <label>{{tip1}}</label>
        </div>
        <div class="captcha_img">
          <input type="text" placeholder="图形验证码" v-model="captcha_img" @blur="check_captcha_img">
          <div class="image">
            <svg xmlns="http://www.w3.org/2000/svg" width="70" height="40">
              <rect width="100%" height="100%" fill="#f5f5f5"></rect>
              <path
                fill="#7be97b"
                d="M26.12 15.65L26.01 15.54L25.95 15.48Q25.60 15.88 25.50 16.42L25.34 16.27L25.34 19.76L25.47 19.88Q26.25 19.89 27.74 19.71L27.79 19.76L27.66 19.62Q27.73 20.00 27.71 20.57L27.67 20.53L27.75 20.61Q27.73 21.14 27.73 21.45L27.68 21.39L26.60 21.46L26.47 21.33Q26.09 21.54 25.50 21.54L25.43 21.47L25.43 21.47Q25.44 24.33 25.39 30.01L25.37 29.99L25.40 30.02Q23.89 30.05 22.88 30.52L22.97 30.61L22.85 30.49Q23.62 26.36 23.55 21.45L23.61 21.51L23.54 21.45Q22.99 21.31 22.11 21.13L22.29 21.31L22.30 21.31Q22.17 20.51 22.04 19.20L22.13 19.28L22.01 19.16Q22.83 19.57 23.47 19.70L23.47 19.70L23.46 19.68Q23.37 19.18 23.16 17.50L23.22 17.56L23.29 17.63Q23.07 16.17 23.07 15.52L23.11 15.56L23.08 15.53Q23.12 14.43 24.07 14.04L23.98 13.95L24.00 13.97Q24.59 13.76 27.87 13.19L27.93 13.25L27.84 13.16Q28.45 13.13 29.02 13.05L28.91 12.94L29.04 13.07Q28.89 13.59 28.79 14.19L28.67 14.07L28.55 15.22L28.58 15.25Q28.02 15.02 27.68 15.10L27.73 15.14L27.71 15.12Q27.39 15.22 26.10 15.64ZM29.74 16.35L29.80 16.41L29.71 16.32Q30.04 14.92 30.46 13.19L30.46 13.19L30.38 13.12Q29.86 13.24 28.98 13.66L29.14 13.82L29.41 12.67L29.23 12.49Q28.60 12.81 26.92 13.17L26.82 13.07L26.77 13.03Q26.07 13.17 23.90 13.79L23.76 13.65L23.78 13.67Q22.80 14.04 22.80 15.30L22.73 15.24L22.82 15.32Q22.70 15.41 22.76 15.65L22.88 15.77L22.84 15.73Q22.93 16.57 23.01 17.47L23.01 17.48L23.24 19.38L23.18 19.32Q22.26 19.08 21.82 18.77L21.86 18.80L21.85 18.80Q21.99 19.50 22.01 20.20L21.91 20.10L22.01 21.46L22.04 21.49Q22.46 21.55 23.00 21.60L23.10 21.70L23.12 23.14L23.39 23.16L23.38 23.14Q23.28 27.28 22.61 30.97L22.48 30.84L22.59 30.96Q23.17 30.53 23.97 30.34L24.08 30.45L23.83 31.73L23.85 31.75Q24.70 31.57 25.58 31.54L25.68 31.64L25.60 31.57Q26.42 31.52 27.27 31.71L27.40 31.84L27.34 31.78Q26.80 28.42 26.80 23.02L26.67 22.90L26.83 23.06Q27.44 22.92 28.87 22.97L28.90 23.01L28.88 21.72L28.87 21.70Q28.98 21.17 29.00 20.53L28.88 20.41L28.91 20.43Q28.61 20.52 27.88 20.70L27.92 20.73L27.85 20.66Q27.96 20.30 28.03 19.40L27.97 19.34L27.99 19.35Q27.47 19.56 26.93 19.62L26.75 19.44L26.93 19.61Q26.87 18.60 26.95 17.64L26.99 17.69L26.95 17.65Q26.99 17.14 27.35 16.91L27.48 17.04L27.36 16.92Q27.97 16.42 28.53 16.37L28.53 16.37L28.51 16.35Q29.15 16.38 29.72 16.33Z"
              ></path>
              <path
                fill="#27e7e7"
                d="M40.18 23.35L40.12 23.30L40.24 23.42Q38.33 23.14 37.43 23.96L37.49 24.02L37.47 24.00Q36.58 24.85 36.79 26.55L36.84 26.60L36.82 26.58Q36.95 28.21 37.77 29.06L37.91 29.20L37.95 29.24Q38.67 30.14 40.11 30.08L40.13 30.10L40.08 30.05Q40.46 30.04 40.59 30.04L40.61 30.07L40.54 30.00Q43.00 29.64 43.07 26.51L42.97 26.40L42.93 26.36Q43.01 24.79 42.54 24.25L42.71 24.41L42.56 24.27Q41.90 23.45 40.17 23.34ZM42.32 31.21L42.32 31.21L42.50 31.39Q41.49 31.67 40.43 31.61L40.41 31.60L40.50 31.69Q37.84 31.77 36.97 30.01L37.07 30.12L36.89 29.94Q36.85 33.64 35.94 36.53L35.97 36.56L36.03 36.62Q34.79 36.93 33.68 37.42L33.71 37.45L33.61 37.35Q35.38 33.33 35.19 28.60L35.18 28.59L35.25 28.66Q35.00 23.94 33.04 19.83L33.04 19.83L33.11 19.90Q34.38 20.66 35.54 20.97L35.62 21.05L35.80 21.87L35.94 22.01Q35.96 22.18 36.14 22.93L36.15 22.94L36.13 22.93Q36.76 21.46 39.19 21.33L39.26 21.41L39.20 21.34Q39.92 21.45 40.51 21.45L40.37 21.30L40.85 21.44L40.82 21.42Q40.77 21.29 40.90 21.32L40.93 21.34L41.20 21.41L41.14 21.34Q42.66 21.65 43.15 21.81L43.05 21.71L43.09 21.75Q44.03 21.99 44.63 22.64L44.76 22.78L44.67 22.68Q45.29 23.54 45.27 24.49L45.28 24.51L45.28 24.51Q45.34 26.50 44.80 28.31L44.67 28.18L44.61 28.12Q43.90 30.49 42.30 31.19ZM45.36 31.77L45.38 31.76L45.30 31.68Q46.12 30.41 46.33 27.62L46.33 27.63L46.31 27.60Q46.40 26.40 46.40 25.55L46.30 25.45L46.43 25.57Q46.31 24.43 45.80 23.47L45.96 23.64L45.87 23.55Q45.59 23.24 45.25 22.98L45.16 22.89L45.07 22.72L45.08 22.65L45.05 22.55L45.04 22.53Q43.87 21.16 40.93 21.16L40.79 21.02L40.45 21.10L40.35 20.99Q37.26 21.06 36.15 22.15L36.10 22.09L36.08 22.08Q36.05 21.82 35.95 21.48L35.98 21.51L35.79 20.77L35.74 20.73Q34.13 20.39 32.64 19.38L32.67 19.41L32.66 19.40Q34.75 23.56 34.96 28.47L35.09 28.60L34.95 28.46Q35.11 33.35 33.17 37.74L33.14 37.71L34.56 37.19L34.65 37.28Q34.37 37.68 33.91 38.73L34.05 38.87L33.96 38.78Q35.73 38.00 37.31 37.77L37.26 37.72L37.30 37.76Q38.14 34.57 38.25 32.04L38.14 31.94L38.21 32.00Q39.23 33.07 41.68 33.23L41.56 33.11L41.68 33.23Q44.27 33.32 45.26 31.66L45.31 31.72ZM41.55 24.96L41.49 24.90L41.43 24.84Q41.80 24.72 42.55 24.95L42.68 25.09L42.67 25.07Q42.82 25.72 42.80 26.52L42.83 26.55L42.71 26.43Q42.70 27.04 42.57 27.48L42.74 27.65L42.67 27.58Q42.11 29.48 40.41 29.68L40.48 29.76L40.50 29.70L40.51 29.71Q40.50 29.75 40.43 29.78L40.41 29.77L40.10 29.81L40.01 29.73Q39.27 29.79 38.60 29.45L38.50 29.35L38.24 27.93L38.28 27.97Q38.31 26.53 39.19 25.83L39.15 25.79L39.14 25.78Q39.80 25.02 41.43 24.84Z"
              ></path>
              <path
                fill="#e22cb4"
                d="M58.47 18.87L58.48 18.87L58.44 18.83Q57.18 15.97 52.97 16.10L53.17 16.30L53.13 16.26Q49.97 16.18 48.63 17.16L48.66 17.20L48.64 17.17Q47.09 18.44 47.09 21.23L47.09 21.23L47.04 22.44L47.02 22.43Q47.10 28.50 53.22 28.50L53.19 28.46L53.26 28.54Q54.60 28.48 55.61 27.94L55.54 27.87L55.60 27.93Q56.88 27.27 56.78 26.01L56.81 26.04L56.72 25.95Q56.62 24.55 54.11 23.93L54.19 24.01L52.89 24.04L52.84 23.98Q52.13 23.92 51.49 23.95L51.59 24.05L51.55 24.01Q51.52 23.34 51.50 22.04L51.47 22.01L51.47 22.01Q56.61 21.96 59.45 21.73L59.56 21.84L59.61 21.89Q59.56 22.44 59.56 22.98L59.48 22.89L59.41 22.82Q59.54 23.50 59.56 24.04L59.60 24.07L59.58 24.06Q58.80 24.03 58.80 24.03L58.82 24.05L58.86 24.08Q57.91 24.06 58.16 24.06L58.01 23.91L58.02 23.91Q58.78 25.04 59.03 26.38L59.16 26.51L59.19 26.53Q59.17 26.93 59.17 27.24L59.24 27.31L59.26 27.33Q59.22 30.44 53.25 30.44L53.12 30.30L53.18 30.37Q48.41 30.43 46.65 29.01L46.71 29.06L46.51 28.87Q45.36 27.45 45.36 24.02L45.35 24.00L45.23 23.89Q45.29 23.22 45.18 21.39L45.07 21.27L45.21 21.41Q44.98 19.68 45.00 18.75L45.11 18.86L45.08 18.83Q45.25 16.98 46.18 15.90L46.02 15.74L46.07 15.79Q47.78 14.37 51.08 14.24L51.15 14.31L52.90 14.20L53.04 14.34Q55.00 14.13 57.33 14.41L57.36 14.45L57.31 14.40Q59.95 14.81 60.59 17.01L60.66 17.07L60.58 17.00Q59.88 17.62 58.46 18.86ZM59.31 20.24L59.57 20.43L59.57 20.43Q60.35 19.66 61.62 18.32L61.64 18.34L61.63 18.33Q61.43 17.69 60.76 16.53L60.70 16.47L60.64 16.41Q59.96 14.72 57.37 14.28L57.37 14.28L57.32 14.22Q55.82 14.09 52.90 13.89L52.94 13.93L51.09 13.99L51.05 13.95Q47.59 14.13 45.83 15.47L45.79 15.43L45.90 15.55Q44.94 16.62 44.86 18.71L44.82 18.68L44.92 18.77Q44.81 18.35 44.96 22.07L45.02 22.13L45.03 22.14Q45.00 23.01 45.05 24.87L44.97 24.79L45.15 24.97Q45.23 27.94 46.41 29.26L46.42 29.26L46.30 29.15Q46.59 29.74 47.18 30.34L47.14 30.30L47.22 30.38Q49.18 31.64 52.93 31.87L52.90 31.85L54.87 31.98L54.95 32.06Q56.06 32.16 57.43 32.08L57.35 32.00L57.32 31.98Q58.42 32.05 59.85 31.68L59.75 31.59L59.73 31.57Q61.05 31.24 61.03 29.66L60.98 29.61L61.06 29.70Q61.04 28.83 60.32 26.94L60.40 27.02L60.38 27.00Q60.16 26.37 59.80 25.83L59.74 25.76L59.70 25.73Q60.25 25.89 61.05 26.02L61.06 26.03L60.88 25.84Q60.75 23.47 60.77 23.00L60.82 23.05L60.87 23.10Q60.54 23.02 60.25 23.00L60.18 22.92L60.25 22.99Q60.08 23.05 59.82 23.10L59.73 23.02L59.75 23.03Q59.64 22.18 59.69 21.46L59.79 21.55L59.70 21.46Q55.61 21.97 51.34 21.89L51.29 21.84L51.21 21.76Q51.21 22.35 51.21 22.97L51.28 23.04L51.33 24.28L51.33 24.28Q51.48 24.17 51.76 24.15L51.94 24.32L51.79 24.18Q52.11 24.21 52.42 24.21L52.34 24.13L52.47 24.25Q52.39 24.49 52.42 24.83L52.52 24.92L52.35 24.76Q52.52 25.24 52.49 25.57L52.36 25.44L52.37 25.45Q53.10 25.45 53.79 25.43L53.84 25.48L53.85 25.49Q54.54 25.48 55.24 25.50L55.22 25.48L55.32 25.58Q55.91 25.63 56.51 25.89L56.47 25.86L56.50 25.91L56.44 25.85Q56.60 26.94 55.46 27.56L55.52 27.62L55.48 27.57Q54.33 28.18 53.17 28.18L53.26 28.28L53.23 28.25Q50.64 28.26 48.98 27.07L48.91 27.00L48.91 27.00Q48.33 25.70 48.43 23.97L48.49 24.02L48.36 23.89Q48.57 20.64 49.82 19.28L49.87 19.33L49.87 19.33Q51.23 18.08 54.41 17.88L54.21 17.68L54.22 17.69Q56.83 17.66 58.14 18.87L58.07 18.80L58.07 18.80Q58.08 18.83 58.15 18.96L58.29 19.10L58.26 18.99L58.23 18.96Q58.84 19.65 59.23 20.40L59.19 20.36L59.39 20.33Z"
              ></path>
              <path
                fill="#6886e3"
                d="M7.22 13.90L7.06 13.74L7.18 13.86Q8.40 17.10 8.79 20.62L8.71 20.53L8.82 20.65Q11.37 17.87 15.37 14.59L15.22 14.44L15.34 14.56Q17.38 14.22 19.16 13.68L19.30 13.81L14.85 17.64L14.84 17.63Q12.40 19.50 10.47 21.44L10.48 21.46L10.58 21.55Q16.04 27.82 19.48 31.02L19.36 30.90L19.37 30.91Q17.37 30.38 15.79 30.28L15.68 30.16L15.77 30.26Q11.74 26.48 8.82 22.53L8.93 22.64L8.93 22.64Q8.90 27.03 7.63 30.64L7.69 30.70L7.75 30.76Q7.49 30.68 7.16 30.81L7.17 30.83L7.20 30.98L7.10 30.88Q7.08 31.02 5.35 31.64L5.24 31.53L5.25 31.54Q7.30 27.13 7.07 22.07L7.16 22.17L6.98 21.98Q6.81 17.06 4.41 12.64L4.41 12.65L4.76 12.82L5.03 13.00L5.18 13.13L5.12 13.07Q5.53 13.25 7.03 13.71ZM7.33 13.62L7.38 13.68L7.39 13.69Q5.66 13.12 3.88 12.08L4.06 12.27L4.05 12.26Q6.86 17.11 6.86 23.18L6.80 23.12L6.80 23.12Q6.88 27.95 4.86 32.06L4.88 32.08L6.29 31.52L6.14 31.38Q5.99 32.18 5.53 33.06L5.49 33.02L5.48 33.01Q7.11 32.58 8.43 32.29L8.30 32.16L8.40 32.11L8.42 32.13Q8.52 32.02 8.91 31.92L8.98 31.99L8.94 31.95Q10.08 27.95 10.16 24.70L10.13 24.67L10.16 24.69Q11.68 26.51 12.92 27.77L12.87 27.72L12.90 27.75Q13.72 28.52 15.76 30.53L15.72 30.49L15.70 30.47L15.66 30.43Q16.44 31.08 17.70 32.16L17.65 32.11L17.57 32.03Q20.30 32.62 22.65 33.78L22.57 33.70L22.63 33.76Q16.33 27.95 12.09 22.91L12.06 22.88L12.03 22.84Q15.14 20.06 21.08 14.23L20.99 14.14L20.93 14.08Q19.21 14.87 17.84 15.13L17.92 15.20L17.84 15.12Q18.67 14.45 20.24 13.08L20.34 13.18L20.22 13.06Q17.44 14.02 15.17 14.15L15.25 14.23L15.31 14.29Q13.22 15.70 9.92 18.87L10.05 19.01L9.92 18.88Q9.79 17.25 9.40 15.52L9.25 15.37L9.24 15.36Q8.50 15.32 7.83 15.08L7.84 15.09L7.75 15.00Q7.62 14.51 7.23 13.53Z"
              ></path>
            </svg>
          </div>
          <label>{{tip2}}</label>
        </div>
        <div class="captcha_info">
          <input type="text" placeholder="短信验证码" v-model="captcha_info" @blur="check_captcha_info">
          <button class="get_captcha" @click="get_captcha_info">获取验证码</button>
          <label>{{tip3}}</label>
        </div>
        <div class="input">
          <input
            type="password"
            placeholder="密码(请输入6~20位字符)"
            v-model="regist_pwd"
            @blur="check_pwd"
          >
          <label>{{tip4}}</label>
        </div>
        <div class="input">
          <input
            type="password"
            placeholder="确认密码"
            v-model="regist_again_pwd"
            @blur="check_again_pwd"
          >
          <label>{{tip5}}</label>
        </div>
        <button class="to_login" @click="to_login">注册</button>

        <div class="login_footer">
          <router-link class="span" to="/login">已经有APIS账号了</router-link>
          <button @click="go_login">登录</button>
        </div>
      </div>
    </div>
  </div>
</template>
<script>
import { getSmsCaptcha, getRegistInfo } from "../api/example.js";
export default {
  data() {
    return {
      regist_account: "",
      captcha_img: "",
      captcha_info: "",
      regist_pwd: "",
      regist_again_pwd: "",
      tip1: "",
      tip2: "",
      tip3: "",
      tip4: "",
      tip5: ""
    };
  },
  methods: {
    //验证手机号
    check_account() {
      if (this.regist_account) {
        var reg = /^1[34578]\d{9}$/;
        if (!reg.test(this.regist_account)) {
          this.tip1 = "手机号码格式不正确!";
          return false;
        } else {
          this.tip1 = "";
          return true;
        }
      } else {
        this.tip1 = "请输入手机号!";
        return false;
      }
    },
    //验证图片验证码
    check_captcha_img() {
      if (this.captcha_img) {
        this.tip2 = "";
        return true;
      } else {
        this.tip2 = "图形验证码不能为空!";
        return false;
      }
    },
    //验证短信验证码
    check_captcha_info() {
      if (this.captcha_info) {
        this.tip3 = "";
        return true;
      } else {
        this.tip3 = "短信验证码不能为空!";
        return false;
      }
    },
    //验证密码
    check_pwd() {
      if (this.regist_pwd) {
        var reg = this.regist_pwd.length;
        if (reg >= 6 && reg <= 20) {
          this.tip4 = "";
          return true;
        } else {
          this.tip4 = "密码必须是6~20位!";
          return false;
        }
      } else {
        this.tip4 = "请输入密码!";
        return false;
      }
    },
    //验证确认密码
    check_again_pwd() {
      if (this.regist_again_pwd) {
        if (this.regist_again_pwd == this.regist_pwd) {
          this.tip5 = "";
          return true;
        } else {
          this.tip5 = "两次输入的密码不一致!";
          return false;
        }
      } else {
        this.tip5 = "请输入密码!";
        return false;
      }
    },
    //获取验证码
    get_captcha_info() {
      if (this.regist_account && this.captcha_img) {
        getSmsCaptcha("register", this.captcha_img, this.regist_account).then(
          res => {
            if (res.data.code === "success") {
              alert(res.data.message);
            }
          }
        );
      }
    },
    //注册
    to_login() {
      if (
        this.check_account() &&
        this.check_pwd() &&
        this.check_captcha_img() &&
        this.check_captcha_info() &&
        this.check_again_pwd()
      ) {
        //调用引入的接口

        getRegistInfo("register", this.regist_account).then(res => {
          if (res.data.code === "success") {
            alert("注册成功");
            this.$router.push("/login");
          }
        });
        this.regist_account = "";
        this.captcha_img = "";
        this.captcha_info = "";
        this.regist_pwd = "";
        this.regist_again_pwd = "";
      }
    },

    go_login() {
      this.$router.push("/login");
    }
  }
};
</script>
<style scoped lang="scss">
.bg_content {
  background: url("../assets/bg_sign.png");
  background-size: 100% 100%;
  height: 860px;
  width: 1275px;
  position: relative;
}
.shade {
  width: 50%;
  height: 66%;
  background: rgba(17, 60, 124, 1);
  position: absolute;
  left: 590.1px;
  top: 107.4px;
}
.bg_regist {
  width: 568px;
  display: flex;
  flex-direction: column;
  align-items: center;
  background: rgba(255, 255, 255, 0.24);
  box-shadow: 6px 6px 14px 5px rgba(39, 52, 101, 0.08);
  position: absolute;
  left: 580px;
  top: 107.8px;
  box-sizing: border-box;
  .regist {
    font-family: MicrosoftYaHei;
    font-size: 36px;
    color: #ffffff;
    text-align: center;
    margin-top: 44.2px;
    margin-bottom: 35px;
    display: block;
  }
  .input {
    width: 380px;
    height: 74px;
    input {
      width: 380px;
      height: 56px;
      font-family: MicrosoftYaHei;
      font-size: 16px;
      color: #9b9b9b;
      box-sizing: border-box;
      text-indent: 20px;
    }
    label {
      font-size: 10px;
      color: red;
      display: block;
    }
  }
  .captcha_img,
  .captcha_info {
    width: 380px;
    height: 74px;
    font-size: 0;
    overflow: hidden;
    display: flex;
    flex-wrap: wrap;
    input {
      width: 228px;
      height: 56px;
      font-family: MicrosoftYaHei;
      font-size: 16px;
      color: #9b9b9b;
      box-sizing: border-box;
      text-indent: 20px;
    }
    .get_captcha {
      margin-left: 12.2px;
      width: 139.8px;
      height: 56px;
      background: #ff8000;
      border-color: #ff8000;
      outline: none;
      font-family: MicrosoftYaHei;
      font-size: 20px;
      color: #ffffff;
      cursor: pointer;
    }
    .image {
      margin-left: 12.2px;
      svg {
        width: 139px;
        height: 56px;
      }
    }
    label {
      font-size: 10px;
      color: red;
      display: block;
    }
  }
}

.to_login {
  margin-top: 24px;
  margin-bottom: 39px;
  width: 380px;
  height: 53px;
  background: #ff8000;
  border-color: #ff8000;
  outline: none;
  font-family: MicrosoftYaHei;
  font-size: 20px;
  color: #ffffff;
  cursor: pointer;
}
.to_regist {
  font-family: MicrosoftYaHei;
  font-size: 14px;
  color: #ffffff;
}
.login_footer {
  width: 100%;
  height: 76px;
  border-top: 1px solid #fff;
  padding: 0 20px;
  align-items: center;
  box-sizing: border-box;
  display: flex;
  justify-content: space-between;
  .span {
    font-family: MicrosoftYaHei;
    font-size: 14px;
    color: #ffffff;
  }
  button {
    background: #ffffff;
    font-family: MicrosoftYaHei;
    font-size: 20px;
    color: #0d407e;
    width: 66px;
    height: 41px;
    cursor: pointer;
  }
}
</style>

